src/cf/AccumulationRegisters/Касса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>Касса</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/cf/AccumulationRegisters/ЗаполненностьТрюма.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ЗаполненностьТрюма</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Объем</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/cf/AccumulationRegisters/Трюм.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>Трюм</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Объем</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Товар</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Товары</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ОбъемыТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ОбъемыТоваров</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Объем</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Товар</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Товары</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Documents/Покупка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>Покупка</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Касса</xr:Item>
				<xr:Item>AccumulationRegister.ЗаполненностьТрюма</xr:Item>
				<xr:Item>AccumulationRegister.Трюм</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Товар</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Товары</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Объем</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/Documents/Продажа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>Продажа</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Касса</xr:Item>
				<xr:Item>AccumulationRegister.ЗаполненностьТрюма</xr:Item>
				<xr:Item>AccumulationRegister.Трюм</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Товар</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Товары</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Объем</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/CommonModules/ТорговаяКонсольПереопределяемый/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Покупатель - Структура:
//  * ТекущаяПланета - СправочникСсылка.Планеты - Планета, на которой находится корабль.
//  * ДенегВНаличии - Число - Денег у покупателя.
//  * СвободноВТрюме - Число - сколько масимально единиц объема способен вместить корабль.
//  * ВместимостьТрюма - Число - сколько масимально единиц объема способен вместить корабль.
//  * ТрюмКорабля - ТаблицаЗначений:
//    * Товар - СправочникСсылка.Товар - Товар, который есть в трюме корабля
//    * Объем - Число - Количество единиц объема в трюме
//    * Себестоимость - Число - Себестоимость товара из трюма
//
Процедура ПриОпределенииПокупателя(Покупатель) Экспорт
	
	Покупатель.ТекущаяПланета = Константы.ТекущаяПланета.Получить();
	Покупатель.ДенегВНаличии = РегистрыНакопления.Касса.Остатки()[0].Сумма;
	Покупатель.СвободноВТрюме = РегистрыНакопления.ЗаполненностьТрюма.Остатки()[0].Объем;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаполненностьТрюма.Объем КАК Объем
		|ИЗ
		|	РегистрНакопления.ЗаполненностьТрюма КАК ЗаполненностьТрюма
		|ГДЕ
		|	ЗаполненностьТрюма.Регистратор ССЫЛКА Документ.УвеличениеОбъемаТрюма";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Покупатель.ВместимостьТрюма = ВыборкаДетальныеЗаписи.Объем;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТрюмОстатки.Товар КАК Товар,
		|	ТрюмОстатки.ОбъемОстаток КАК Объем
		|ИЗ
		|	РегистрНакопления.Трюм.Остатки КАК ТрюмОстатки";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НовСтр = Покупатель.ТрюмКорабля.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, ВыборкаДетальныеЗаписи);
	КонецЦикла;
	
КонецПроцедуры

// Планета - СправочникСсылка.Планеты - Планета на которой совершалась сделка
// Товар - СправочникСсылка.Товары - Товар, который покупается
// Количество - Число - Объем купленного товара
// ЦенаПокупка - Число
//
Процедура ПокупкаТовара(Панета, Товар, Количество, ЦенаПокупка) Экспорт
	
	Покупка = Документы.Покупка.СоздатьДокумент();
	Покупка.Дата = ТекущаяДатаСеанса();
	Покупка.Товар = Товар;
	Покупка.Количество = Количество;
	Покупка.Цена = ЦенаПокупка;
	Покупка.Объем = РегистрыСведений.ОбъемыТоваров.Получить(Новый Структура("Товар", Товар)).Объем * Количество;
	Покупка.Записать(РежимЗаписиДокумента.Проведение);
	
КонецПроцедуры

// Планета - СправочникСсылка.Планеты - Планета на которой совершалась сделка
// Товар - СправочникСсылка.Товары - Товар, который продается
// Количество - Число - Объем продаваемого товара
// ЦенаПродажи - Число
//
Процедура ПродажаТовара(Панета, Товар, Количество, ЦенаПродажи) Экспорт
	
	Продажа = Документы.Продажа.СоздатьДокумент();
	Продажа.Дата = ТекущаяДатаСеанса();
	Продажа.Товар = Товар;
	Продажа.Количество = Количество;
	Продажа.Цена = ЦенаПродажи;
	Продажа.Объем = РегистрыСведений.ОбъемыТоваров.Получить(Новый Структура("Товар", Товар)).Объем * Количество;
	Продажа.Записать(РежимЗаписиДокумента.Проведение);
	
КонецПроцедуры

#КонецОбласти
